; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	infrared7 - mode
	spectrograph3 - mode
	thermograph5 - mode
	thermograph6 - mode
	image2 - mode
	spectrograph0 - mode
	image4 - mode
	thermograph1 - mode
	Star1 - direction
	GroundStation3 - direction
	GroundStation5 - direction
	Star0 - direction
	GroundStation2 - direction
	Star4 - direction
	Star6 - direction
	Star7 - direction
	Phenomenon8 - direction
	Planet9 - direction
	Planet10 - direction
	Planet11 - direction
)
(:init
	(supports instrument0 spectrograph3)
	(supports instrument0 image2)
	(supports instrument0 thermograph6)
	(calibration_target instrument0 Star0)
	(supports instrument1 infrared7)
	(supports instrument1 image4)
	(supports instrument1 thermograph1)
	(supports instrument1 spectrograph0)
	(supports instrument1 thermograph5)
	(calibration_target instrument1 Star4)
	(calibration_target instrument1 GroundStation2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star4)
)
(:goal (and
	(have_image Star6 spectrograph3)
	(have_image Star6 spectrograph0)
	(have_image Star7 infrared7)
	(have_image Star7 image2)
	(have_image Phenomenon8 spectrograph0)
	(have_image Planet9 image4)
	(have_image Planet10 thermograph5)
	(have_image Planet10 spectrograph0)
	(have_image Planet11 spectrograph3)
))

)

; plan
1. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 9
2. (calibrate satellite0 instrument1 star4)
   added: (calibrated instrument1)
   goals met: 0 of 9
3. (turn_to satellite0 star7 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 star7)
   goals met: 0 of 9
4. (take_image satellite0 star7 instrument1 infrared7)
   added: (have_image star7 infrared7)
   goals met: 1 of 9
5. (turn_to satellite0 star6 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 star6)
   goals met: 1 of 9
6. (take_image satellite0 star6 instrument1 spectrograph0)
   added: (have_image star6 spectrograph0)
   goals met: 2 of 9
7. (turn_to satellite0 planet9 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 planet9)
   goals met: 2 of 9
8. (take_image satellite0 planet9 instrument1 image4)
   added: (have_image planet9 image4)
   goals met: 3 of 9
9. (turn_to satellite0 phenomenon8 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 phenomenon8)
   goals met: 3 of 9
10. (take_image satellite0 phenomenon8 instrument1 spectrograph0)
   added: (have_image phenomenon8 spectrograph0)
   goals met: 4 of 9
11. (turn_to satellite0 planet10 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 planet10)
   goals met: 4 of 9
12. (take_image satellite0 planet10 instrument1 spectrograph0)
   added: (have_image planet10 spectrograph0)
   goals met: 5 of 9
13. (take_image satellite0 planet10 instrument1 thermograph5)
   added: (have_image planet10 thermograph5)
   goals met: 6 of 9
14. (switch_off instrument1 satellite0)
   deleted: (power_on instrument1)
   added: (power_avail satellite0)
   goals met: 6 of 9
15. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 6 of 9
16. (turn_to satellite0 star0 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 star0)
   goals met: 6 of 9
17. (calibrate satellite0 instrument0 star0)
   added: (calibrated instrument0)
   goals met: 6 of 9
18. (turn_to satellite0 planet11 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 planet11)
   goals met: 6 of 9
19. (take_image satellite0 planet11 instrument0 spectrograph3)
   added: (have_image planet11 spectrograph3)
   goals met: 7 of 9
20. (turn_to satellite0 star6 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 star6)
   goals met: 7 of 9
21. (take_image satellite0 star6 instrument0 spectrograph3)
   added: (have_image star6 spectrograph3)
   goals met: 8 of 9
22. (turn_to satellite0 star7 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 star7)
   goals met: 8 of 9
23. (take_image satellite0 star7 instrument0 image2)
   added: (have_image star7 image2)
   goals met: 9 of 9
